#include <iostream>
using namespace std;
void checkValidInput() //Ця функція відображає випадок, який генерується програмою, 
                       //коли користувач вводить невірне значення для n та x, наприклад букву чи недійсний символ.
{
	if (cin.fail())
	{
		throw "Incorrect Input data";
	}
}

void checkValidParams(int n) //Ця функція відображає умову рівняння. Якщо введене число n буде менше 2, 
                             //то рівняння не буде розраховано і компілятор видасть помилку з проханням 
							 //ввести правильні данні.
{
	if (n < 2)
	{
		throw "Input correct data";
	}
}

double calculate(int n, double x) //Функція calculate слугує розрахунковою функцією, 
                                  //в цій функції відбуваються усі розрахунки.
{
	if (x < 0) //Якщо x < 0, то виконується умова першої функції та вирішення йде по цій функції.
	{
		int i = 1; //Ініціалізуємо локалну змінну. Ці данні зазначалися разом з умовою першої функції.
		double y = 0; //Ініціалізуємо локалну змінну. Так як в умові зазначена сума, то у=0.
		if (i <= (n - 1)) //Виконання умов суми першої фунції.
		{
			int j = 1; //Ініціалізуємо локалну змінну. Ці данні зазначалися разом з умовою другої функції.
			double sum = 0; //Ініціалізуємо локалну змінну. Так як в умові зазначена сума, то у = 0.
			do
			{
				sum += (x - i + j);
				j++;
			} while (j < n); //Блок ду вайл для внесення певних умов та виконання певних дій.
			y += sum;
			i++;
		}
		return y; //Функція return повертає певне значення(в нашому випадку у) назад до функції виклику.
	}
	if (x >= 0) //Якщо x >= 0, то виконується умова другої функції та вирішення йде по цій функції.
	{
		double y = 0; //Ініціалізуємо локалну змінну. Так як в умові зазначена сума, то у=0.
		int i = 0; //Ініціалізуємо локалну змінну. Ці данні зазначалися разом з умовою другої функції.
		for (i = 1; i <= (n - 1); i++) //Цикл фор для виконання повторювальних дій.
		{
			y += (x / i);
		}
		return y; //Функція return повертає певне значення(в нашому випадку у) назад до функції виклику.
	}
}
int main() //Функція main. Забезпечує ввід та вивід данних, обчислених та отриманих з інших функцій.
{
	double x; //Ініціалізуємо глобальну змінну.
	int n; //Ініціалізуємо глобальну змінну.
	try //Блок try catch "відловлює" усі помилки, які могли трапитися під час виконання программи та 
		//показує користувачу ці помилки та деякі способи вирішення цих помилок.
	{
		cout << "Enter n>=2: "; //Вводимо значення n, але з умовою, що n>=2.
		cin >> n;
		checkValidInput(); //Посилання на функцію checkValidInput для отримання данних.
		checkValidParams(n); //Посилання на функцію checkValidParams для отримання данних.
		cout << "Enter x: "; //Вводимо х щоб розразувати функцію.
		cin >> x;
		checkValidInput(); //Посилання на функцію checkValidInput для отримання данних.
		cout << "x= " << x << "; " << "y= " << calculate(n, x) << endl; //Вивід розрахованих данних, які були
		                                                                //розраховані в функції calculate, на екран.
	}
	catch (const char* ex) //Частина блоку try catch, в якій відбувається "відловлювання" помилок 
		                   //та вивід важливої інформації щодо вирішення цієї помилки на екран.
	{
		cout << ex << endl; //Вивід помилки та інформації про цю помилку.
		return -1;
	}
	catch (...)
	{
		cout << "Unknown error" << endl; //Вивід невідомої помилки без якої небуть інформації.
		return -2;
	}
}